use ssm;

drop table carts;

drop table orders;

drop table reviews;

drop table sellers;

drop table stars;

drop table products;

drop table categories;

drop table users;


# 用户表
CREATE TABLE Users
(
    UserID           INT AUTO_INCREMENT PRIMARY KEY COMMENT '用户id，主键，自增',
    Username         VARCHAR(255) NOT NULL COMMENT '用户名，不能为空',
    Password         VARCHAR(255) NOT NULL COMMENT '用户密码，不能为空',
    Email            VARCHAR(255) NOT NULL COMMENT '用户电子邮件地址，不能为空',
    PhoneNumber      VARCHAR(20)  NOT NULL COMMENT '用户手机号码，不能为空',
    RegistrationDate DATETIME     NOT NULL COMMENT '用户注册日期，不能为空',
    LastLoginDate    DATETIME COMMENT '用户最后登录日期，可以为空'
);

# 商家表
CREATE TABLE Sellers
(
    SellerID    INT PRIMARY KEY AUTO_INCREMENT COMMENT '商家ID，主键，自增',
    SellerName  VARCHAR(255) NOT NULL COMMENT '商家名称',
    Password    VARCHAR(255) NOT NULL COMMENT '商家密码',
    Description TEXT COMMENT '商家描述',
    Email       VARCHAR(255) COMMENT '商家电子邮件地址，可以为空',
    PhoneNumber VARCHAR(20)  NOT NULL COMMENT '商家手机号码，不能为空'
);


# 商品分类表
CREATE TABLE Categories
(
    CategoryID   INT PRIMARY KEY AUTO_INCREMENT COMMENT '分类ID，主键，自增',
    CategoryName VARCHAR(255) NOT NULL COMMENT '分类名称'
);

# 商品表
CREATE TABLE Products
(
    ProductID      INT PRIMARY KEY AUTO_INCREMENT COMMENT '商品id，主键，自增',
    ProductName    VARCHAR(255)         NOT NULL COMMENT '商品名称',
    ProductStoreID INT                  NOT NULL COMMENT '商家id',
    Description    TEXT COMMENT '商品描述',
    Price          DECIMAL(10, 2)       NOT NULL COMMENT '价格',
    StockQuantity  INT                  NOT NULL COMMENT '库存数量',
    CategoryID     INT COMMENT '商品分类id',
    ImageURL       Text(25500) COMMENT '图片url', # 前四张是图片展示，后面是介绍
        ListedDate     DATE COMMENT '上架日期',
    Status         ENUM ('0', '1', '2') NOT NULL COMMENT '状态：特价，现售，预售'
);


# 订单表
CREATE TABLE Orders
(
    OrderID         INT PRIMARY KEY AUTO_INCREMENT COMMENT '订单ID，主键，自增',
    UserID          INT                           NOT NULL COMMENT '用户ID',
    ProductID       INT                           NOT NULL COMMENT '商品ID',
    SellerID        INT                           NOT NULL COMMENT '商家ID',
    Quantity        INT                           NOT NULL COMMENT '商品数量',
    TotalAmount     DECIMAL(10, 2)                NOT NULL COMMENT '订单总金额',
    DeliveryAddress VARCHAR(255)                  NOT NULL COMMENT '送达地址',
    RecipientName   VARCHAR(255)                  NOT NULL COMMENT '收件人姓名',
    RecipientPhone  VARCHAR(20)                   NOT NULL COMMENT '收件人电话',
    notes           VARCHAR(255) COMMENT '备注',
    OrderStatus     ENUM ('0', '1', '2', '3','4') NOT NULL COMMENT '订单状态：待支付，已支付，已发货，已收货,已评价',
    OrderDate       DATETIME                      NOT NULL COMMENT '下单时间',
    PaymentDate     DATETIME COMMENT '支付时间',
    ShippingDate    DATETIME COMMENT '发货时间',
    DeliveryDate    DATETIME COMMENT '收货时间'
);


# 评价表
CREATE TABLE Reviews
(
    ReviewID   INT PRIMARY KEY AUTO_INCREMENT COMMENT '评价ID，主键，自增',
    ProductID  INT      NOT NULL COMMENT '商品ID',
    UserID     INT      NOT NULL COMMENT '用户ID',
    Rating     INT      NOT NULL COMMENT '评分',
    Comment    TEXT COMMENT '评论内容',
    ReviewTime DATETIME NOT NULL COMMENT '评论时间'
);


# 购物车表
CREATE TABLE Carts
(
    CartID    INT PRIMARY KEY AUTO_INCREMENT COMMENT '购物车ID，主键，自增',
    UserID    INT NOT NULL COMMENT '用户ID',
    ProductID INT NOT NULL COMMENT '商品ID',
    Quantity  INT NOT NULL COMMENT '商品数量'
);


# 收藏表
CREATE TABLE stars
(
    StarID    INT PRIMARY KEY AUTO_INCREMENT COMMENT '收藏ID，主键，自增',
    UserID    INT NOT NULL COMMENT '用户ID',
    ProductID INT NOT NULL COMMENT '商品ID',
    Quantity  INT NOT NULL COMMENT '商品数量'
);



insert into Categories (CategoryName)
values ('电脑'),
       ('手机'),
       ('相机'),
       ('配件');


insert into Products
values (null, '商品1', 1,
        'main={机身颜色,存储容量};机身颜色={红色,白色,黑色};存储容量={12+256,12+128,16+128,16+256};A={1,2,3}', 19.9,
        100, 1,
        'https://img13.360buyimg.com/n1/s450x450_jfs/t1/91224/1/52035/43615/66e97ba6F8316abb0/bdbd9bfc5aa3cfe6.jpg.avif;
                    https://img.alicdn.com/imgextra/i1/76093316/O1CN01NZysHq1aMmAruJbdY_!!76093316.jpg_.webp;
https://img.alicdn.com/imgextra/i2/76093316/O1CN01VHZpOC1aMmAmkxZkn_!!76093316.jpg_q50.jpg_.webp;
https://img.alicdn.com/imgextra/i4/76093316/O1CN018vgDSI1aMmLillWPc_!!76093316.jpg_q50.jpg_.webp;
https://img.alicdn.com/imgextra/i1/2216790685291/O1CN017Et6r01oxKX4z4sW7_!!2216790685291.jpg;
https://img.alicdn.com/imgextra/i2/2216790685291/O1CN01Tb88jX1oxKUaOsaVq_!!2216790685291.png;
https://img.alicdn.com/imgextra/i4/2216790685291/O1CN01SGm5XW1oxKUiRYda0_!!2216790685291.png;
https://img.alicdn.com/imgextra/i2/2216790685291/O1CN01mraez71oxKUck7Oy2_!!2216790685291.png;
https://img.alicdn.com/imgextra/i2/2216790685291/O1CN01pXul601oxKUiRYVIl_!!2216790685291.png;
https://img.alicdn.com/imgextra/i2/2216790685291/O1CN01lsppcL1oxKUcpYg8C_!!2216790685291.png;
https://img.alicdn.com/imgextra/i1/2216790685291/O1CN01PdWDbI1oxKUZH9KYj_!!2216790685291.png;
https://img.alicdn.com/imgextra/i2/2216790685291/O1CN01SRzEkg1oxKUenUEVY_!!2216790685291.png;
https://img.alicdn.com/imgextra/i3/2216790685291/O1CN012PVRWT1oxKUcmV6KA_!!2216790685291.png;
https://img.alicdn.com/imgextra/i3/2216790685291/O1CN01jbosK61oxKUfZKEnS_!!2216790685291.png;
https://img.alicdn.com/imgextra/i3/2216790685291/O1CN01TTCbLi1oxKUgtkF9q_!!2216790685291.png;
https://img.alicdn.com/imgextra/i2/2216790685291/O1CN01dxh8H51oxKUck8H5x_!!2216790685291.png;
https://img.alicdn.com/imgextra/i2/2216790685291/O1CN01YcSEvh1oxKUhiDaM8_!!2216790685291.png;
https://img.alicdn.com/imgextra/i3/2216790685291/O1CN01xdfHI71oxKUfZLe8E_!!2216790685291.png;
https://img.alicdn.com/imgextra/i3/2216790685291/O1CN01H8a5wx1oxKUdib8Wo_!!2216790685291.png;
https://img.alicdn.com/imgextra/i1/O1CN011GDmVH1PCjsNLVMtP_!!6000000001805-2-tps-750-880.png',
        '2023-01-01', '1'),
       (null, '商品2', 1, '描述2', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品3', 1, '描述3', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品4', 1, '描述4', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品5', 1, '描述5', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品6', 1, '描述6', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品7', 1, '描述7', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品8', 1, '描述8', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品9', 1, '描述9', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品10', 1, '描述10', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品11', 1, '描述11', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品12', 1, '描述12', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品13', 1, '描述13', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品14', 1, '描述14', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品15', 1, '描述15', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品16', 1, '描述16', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品17', 1, '描述17', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品18', 1, '描述18', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品19', 1, '描述19', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品20', 1, '描述20', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品21', 1, '描述21', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品22', 1, '描述22', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品23', 1, '描述23', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品24', 1, '描述24', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品25', 1, '描述25', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品26', 1, '描述26', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品27', 1, '描述27', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品28', 1, '描述28', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品29', 1, '描述29', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品30', 1, '描述30', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品31', 1, '描述31', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品32', 1, '描述32', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品33', 1, '描述33', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品34', 1, '描述34', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品35', 1, '描述35', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品36', 1, '描述36', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品37', 1, '描述37', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品38', 1, '描述38', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品39', 1, '描述39', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品40', 1, '描述40', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品41', 1, '描述41', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品42', 1, '描述42', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品43', 1, '描述43', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品44', 1, '描述44', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品45', 1, '描述45', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品46', 1, '描述46', 19.9, 100, 3, 'url', '2023-01-02', '1'),
       (null, '商品47', 1, '描述47', 19.9, 100, 4, 'url', '2023-01-02', '1'),
       (null, '商品48', 1, '描述48', 19.9, 100, 1, 'url', '2023-01-02', '1'),
       (null, '商品49', 1, '描述49', 19.9, 100, 2, 'url', '2023-01-02', '1'),
       (null, '商品50', 1, '描述50', 19.9, 100, 3, 'url', '2023-01-02', '1');
#        (null, '商品51', 1, '描述51', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品52', 1, '描述52', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品53', 1, '描述53', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品54', 1, '描述54', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品55', 1, '描述55', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品56', 1, '描述56', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品57', 1, '描述57', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品58', 1, '描述58', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品59', 1, '描述59', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品60', 1, '描述60', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品61', 1, '描述61', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品62', 1, '描述62', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品63', 1, '描述63', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品64', 1, '描述64', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品65', 1, '描述65', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品66', 1, '描述66', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品67', 1, '描述67', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品68', 1, '描述68', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品69', 1, '描述69', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品70', 1, '描述70', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品71', 1, '描述71', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品72', 1, '描述72', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品73', 1, '描述73', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品74', 1, '描述74', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品75', 1, '描述75', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品76', 1, '描述76', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品77', 1, '描述77', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品78', 1, '描述78', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品79', 1, '描述79', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品80', 1, '描述80', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品81', 1, '描述81', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品82', 1, '描述82', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品83', 1, '描述83', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品84', 1, '描述84', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品85', 1, '描述85', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品86', 1, '描述86', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品87', 1, '描述87', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品88', 1, '描述88', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品89', 1, '描述89', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品90', 1, '描述90', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品91', 1, '描述91', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品92', 1, '描述92', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品93', 1, '描述93', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品94', 1, '描述94', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品95', 1, '描述95', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品96', 1, '描述96', 19.9, 100, 1, 'url', '2023-01-02', '1'),
#        (null, '商品97', 1, '描述97', 19.9, 100, 2, 'url', '2023-01-02', '1'),
#        (null, '商品98', 1, '描述98', 19.9, 100, 3, 'url', '2023-01-02', '1'),
#        (null, '商品99', 1, '描述99', 19.9, 100, 4, 'url', '2023-01-02', '1'),
#        (null, '商品100', 1, '描述100', 19.9, 100, 1, 'url', '2023-01-02', '1');


insert into users
values (null, 1, 1, 1, 12345678901, '2024-10-9', null);



insert into reviews
values (null, 1, 1, 5, '第1页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第1页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第1页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第2页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第2页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第2页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第3页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第3页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第3页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第4页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第4页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第4页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第5页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第5页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第5页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第6页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第6页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第6页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第7页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第7页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第7页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第8页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第8页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第8页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第9页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第9页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第9页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第10页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第10页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第10页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第11页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第11页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第11页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第12页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第12页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第12页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第13页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第13页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第13页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第14页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第14页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第14页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第15页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第15页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第15页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第16页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第16页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第16页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第17页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第17页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第17页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第18页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第18页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第18页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第19页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第19页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第19页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第20页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第20页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第20页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第21页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第21页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第21页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第22页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第22页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第22页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第23页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第23页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第23页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第24页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第24页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第24页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第25页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第25页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第25页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第26页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第26页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第26页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第27页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第27页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第27页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第28页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第28页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第28页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第29页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第29页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第29页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第30页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第30页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第30页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第31页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第31页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第31页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第32页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第32页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第32页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第33页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第33页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第33页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第34页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第34页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第34页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第35页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第35页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第35页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第36页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第36页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第36页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 2, '第37页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 1, '第37页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 5, '第37页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 4, '第38页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 3, '第38页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 2, '第38页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 1, '第39页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 5, '第39页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 4, '第39页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 3, '第40页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 2, '第40页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 1, '第40页评论，第3条评论', '2024-10-14'),
       (null, 1, 1, 5, '第41页评论，第1条评论', '2024-10-14'),
       (null, 1, 1, 4, '第41页评论，第2条评论', '2024-10-14'),
       (null, 1, 1, 3, '第41页评论，第3条评论', '2024-10-14');

